Repository: vitu168/note_app
Catalog: lib/l10n/app_*.arb
Languages: km

source: Hello
km: សួស្តី

source: Settings
km: ការកំណត់

source: General
km: ទូទៅ

source: Dark Mode
km: របៀបងងឹត

# darkModeDesc
source: Switch between light and dark themes
km: ប្ដូររវាងពន្លឺ និងងងឹត

source: Grid View
km: ទិដ្ឋភាពក្រឡា

# gridViewDesc
source: Display notes in grid or list layout
km: បង្ហាញកំណត់ចំណាំជាក្រឡា ឬបញ្ជី

source: App Language
km: ភាសា

# chooseLanguage
source: Choose your preferred language
km: ជ្រើសរើសភាសាដែលអ្នកចូលចិត្ត

source: Security
km: សុវត្ថិភាព

# biometric
source: Biometric Lock
km: ចាក់សោដោយជីវមាត្រ

# biometricDesc
source: Require fingerprint or face unlock
km: ទាមទារជើងវិញស្នាមម្រាមដៃ ឬមុខ

source: Notifications
km: ការជូនដំណឹង

source: Enable Notifications
km: បើកការជូនដំណឹង

# notificationsDesc
source: Receive reminders for notes
km: ទទួលការរំលឹកសម្រាប់កំណត់ចំណាំ

source: Account
km: គណនី

# clearNotes
source: Clear All Notes
km: លុបកំណត់ចំណាំទាំងអស់

# clearNotesDesc
source: Permanently delete all notes
km: លុបកំណត់ចំណាំទាំងអស់ជាអចិន្ត្រៃយ៍

source: Feedback
km: មតិយោបល់

# feedbackDesc
source: Send us your feedback or report a bug
km: ផ្ញើមតិយោបល់ ឬរាយការណ៍បញ្ហា

source: Logout
km: ចាកចេញ

# logoutDesc
source: Sign out of your account
km: ចាកចេញពីគណនីរបស់អ្នក

# about
source: About App
km: អំពីកម្មវិធី

# version
source: Version 1.0.0
km: កំណែ 1.0.0

source: Cancel
km: បោះបង់

source: Clear
km: លុប

# logoutQ
source: Logout?
km: ចាកចេញ?

# logoutConfirm
source: Are you sure you want to logout?
km: តើអ្នកពិតជាចង់ចាកចេញមែនទេ?

source: Continue with Guest
km: បន្តជាអ្នកប្រើប្រាស់មិនមានគណនី

source: Add Note
km: បន្ថែមកំណត់ចំណាំ

source: Title
km: ចំណងជើង

# titleHint
source: Enter note title
km: បញ្ចូលចំណងជើង

# titleRequired
source: Title is required
km: ត្រូវបញ្ចូលចំណងជើង

source: Content
km: មាតិកា

# contentHint
source: Write your note...
km: សរសេរកំណត់ចំណាំ...

# contentRequired
source: Content is required
km: ត្រូវបញ្ចូលមាតិកា

source: Reminder
km: ការរំលឹក

source: Set Reminder
km: កំណត់ការរំលឹក

source: Change Reminder
km: ផ្លាស់ប្តូរការរំលឹក

source: Remove reminder
km: លុបការរំលឹក

source: Save
km: រក្សាទុក

source: Note saved!
km: បានរក្សាទុក!

# markFavorite
source: Mark as Favorite
km: សម្គាល់ថាជាចំណងចិត្ត

source: Notes
km: កំណត់ចំណាំ

# searchHint
source: Search notes...
km: ស្វែងរកកំណត់ចំណាំ...

# sortDate
source: Date
km: តាមថ្ងៃ

# sortTitle
source: Title
km: តាមចំណងជើង

# sortFavorites
source: Favorites
km: ចំណាំដែលចូលចិត្ត

# switchToList
source: Switch to List View
km: ប្តូរទៅបញ្ជី

# switchToGrid
source: Switch to Grid View
km: ប្តូរទៅជាក្រឡា

# noNotes
source: No notes yet! Tap the button below to add one.
km: មិនទាន់មានកំណត់ចំណាំទេ! ចុចប៊ូតុងខាងក្រោមដើម្បីបន្ថែម។

# noteSavedTitle
source: Note Saved
km: បានរក្សាទុកកំណត់ចំណាំ

# noteSavedMsg
source: Your note was saved successfully.
km: កំណត់ចំណាំបានរក្សាទុកដោយជោគជ័យ។

# noNotifications
source: No notifications yet
km: មិនទាន់មានការជូនដំណឹងទេ

source: Edit Profile
km: កែប្រែប្រវត្តិរូប

# editSoon
source: Edit profile coming soon!
km: មុខងារកែប្រែប្រវត្តិរូបនឹងមកដល់បន្ទាប់!

source: Home
km: ទំព័រដើម

source: Favorites
km: ចំណាំដែលចូលចិត្ត

source: Archive
km: បណ្ណសារ

# setting
source: Settings
km: ការកំណត់

source: Get Started
km: ចាប់ផ្តើម

source: Welcome
km: សូមស្វាគមន៍

source: Profile
km: ប្រវត្តិរូប

source: Profile Detail
km: ព័ត៌មានលម្អិតអំពីប្រវត្តិរូប

source: Notification settings updated
km: ការកំណត់ការជូនដំណឹងបានអាប់ដេត

# feedbackComingSoon
source: Feedback feature coming soon!
km: មុខងារមតិយោបល់នឹងមកដល់បន្ទាប់!

# notificationReminder
source: Reminder
km: ការរំលឹក

# notificationNoteSaved
source: Note Saved
km: បានរក្សាទុកកំណត់ចំណាំ

# notificationReminderBody
source: Don't forget your meeting at 10:00 AM.
km: កុំភ្លេចកិច្ចប្រជុំរបស់អ្នកនៅម៉ោង 10:00 ព្រឹក។

# notificationNoteSavedBody
source: Your note was saved successfully.
km: កំណត់ចំណាំរបស់អ្នកបានរក្សាទុកដោយជោគជ័យ។

# profileName
source: John Doe
km: ចន ដូ

source: language
km: ភាសា
